{
  "project": "Tournado",
  "branchName": "ralph/delete-group-stage",
  "description": "Add the ability to delete a Group Stage from Competition Management. Currently, group stages can be created and edited, but not deleted - making testing and data management difficult. This feature extends the existing Competition Management flow by adding a delete button to the group stage detail view, following the established delete patterns from Teams and Tournaments.",
  "userStories": [
    {
      "id": "UC-000",
      "title": "Add createdBy field to Tournament and GroupStage models",
      "description": "As a developer, I need ownership tracking on Tournament and GroupStage to enable MANAGER role permission checks.",
      "acceptanceCriteria": [
        "Add createdBy field (String, required, references User.id) to Tournament model in prisma/schema.prisma",
        "Add createdBy field (String, required, references User.id) to GroupStage model in prisma/schema.prisma",
        "Generate migration: pnpm prisma migrate dev --name add_createdby_to_tournament_and_groupstage --create-only",
        "Edit migration SQL to backfill existing records: set createdBy to the ID of user with email madrus@gmail.com",
        "Apply migration: pnpm prisma migrate deploy",
        "Update createTournament function to set createdBy from authenticated user",
        "Update createGroupStage function to set createdBy from authenticated user",
        "Update ALL test fixtures that create Tournament or GroupStage objects to include createdBy field (use a valid test user ID from test setup or the backfill user ID)",
        "Typecheck passes",
        "Lint passes",
        "Create unit tests in app/models/__tests__/tournament.server.test.ts for createTournament with createdBy",
        "Create unit tests in app/models/__tests__/group.server.test.ts for createGroupStage with createdBy",
        "Run unit tests: pnpm test:run - all tests must pass"
      ],
      "priority": 1,
      "passes": true,
      "notes": "Decision: Backfill Strategy - Use required createdBy field. Backfill existing records with the user ID of the user with email madrus@gmail.com. Query the User table to get the ID during migration."
    },
    {
      "id": "UC-001",
      "title": "Add delete model function for group stage",
      "description": "As a developer, I need a server function to safely delete a group stage and all its child records.",
      "acceptanceCriteria": [
        "Create deleteGroupStage function in app/models/group.server.ts",
        "Function accepts groupStageId parameter",
        "Deletes GroupStage, all Groups, and all GroupSlots in a transaction",
        "Teams referenced by GroupSlots remain in database (Prisma onDelete: SetNull handles this)",
        "Returns deletion statistics: { groupsDeleted: number, slotsDeleted: number }",
        "Typecheck passes",
        "Lint passes",
        "Create unit tests in app/models/__tests__/group.server.test.ts for deleteGroupStage",
        "Test cascade deletion of Groups and GroupSlots",
        "Test that Teams remain (GroupSlot.teamId set to null)",
        "Test transaction rollback on error",
        "Run unit tests: pnpm test:run - all tests must pass"
      ],
      "priority": 2,
      "passes": false,
      "notes": ""
    },
    {
      "id": "UC-002",
      "title": "Add pre-delete validation function",
      "description": "As a developer, I need a function to check if a group stage can be safely deleted and report what will be affected.",
      "acceptanceCriteria": [
        "Create canDeleteGroupStage function in app/models/group.server.ts",
        "Returns { canDelete: boolean, reason?: string, impact: { groups: number, assignedTeams: number, matchesToDelete: number } }",
        "canDelete: false with reason ONLY if matches with status: PLAYED exist for teams in this group stage",
        "Non-played matches (UPCOMING, CANCELLED, POSTPONED) are included in matchesToDelete count and will be cascade-deleted",
        "Impact shows number of groups, currently assigned teams that will be unassigned, and matches to be deleted",
        "Typecheck passes",
        "Lint passes",
        "Create unit tests in app/models/__tests__/group.server.test.ts for canDeleteGroupStage",
        "Test returns canDelete: false when matches with PLAYED status exist",
        "Test returns canDelete: true when only non-played matches exist",
        "Test returns canDelete: true when no matches exist",
        "Test impact calculation includes correct counts",
        "Run unit tests: pnpm test:run - all tests must pass"
      ],
      "priority": 3,
      "passes": false,
      "notes": ""
    },
    {
      "id": "UC-003",
      "title": "Add delete action to group stage route",
      "description": "As a developer, I need the route action to handle delete intent for group stages.",
      "acceptanceCriteria": [
        "Add intent: 'delete' handler to app/routes/admin/competition/competition.groups.$groupStageId.tsx action",
        "Validate user has ADMIN role (can delete any) OR MANAGER role with ownership",
        "For MANAGER: verify user is the creator of EITHER the tournament OR the group stage itself",
        "Call canDeleteGroupStage before deletion - return error if blocked (matches with PLAYED status)",
        "Call deleteGroupStage on success (cascades to non-played matches)",
        "Redirect to /admin/competition/groups?tournament={tournamentId}&success=deleted after deletion",
        "On redirect target, show success toast: \"Group stage deleted successfully\" (translated)",
        "Typecheck passes",
        "Lint passes",
        "Create unit tests in test/routes/admin/competition/competition.groups.$groupStageId.test.ts for delete action",
        "Test ADMIN can delete any group stage",
        "Test MANAGER can delete if they created tournament",
        "Test MANAGER can delete if they created group stage",
        "Test MANAGER cannot delete if they didn't create tournament or group stage",
        "Test deletion blocked when matches with PLAYED status exist",
        "Test successful deletion redirects with success param",
        "Run unit tests: pnpm test:run - all tests must pass"
      ],
      "priority": 4,
      "passes": false,
      "notes": ""
    },
    {
      "id": "UC-004",
      "title": "Add delete button to group stage detail header",
      "description": "As a user (ADMIN/MANAGER), I want a delete button in the group stage detail view so I can remove incorrect configurations.",
      "acceptanceCriteria": [
        "Add delete button to the header section of CompetitionGroupStageDetails.tsx",
        "Button positioned on the opposite side of the \"Back to Groups\" link (same row, vertically middle-aligned, using justify-between)",
        "Button uses ActionButton with icon='delete' and variant='secondary'",
        "Button triggers SimpleConfirmDialog with intent='danger'",
        "All new UI strings extracted to translation files (nl.json, en.json, ar.json, etc.)",
        "Layout verified for responsiveness (Mobile/Desktop) and Bi-directional flow (LTR/RTL mirroring)",
        "Typecheck passes",
        "Lint passes",
        "Create unit tests in app/features/competition/components/__tests__/CompetitionGroupStageDetails.test.tsx",
        "Test delete button renders for ADMIN role",
        "Test delete button renders for MANAGER role (with ownership)",
        "Test delete button does not render for unauthorized roles",
        "Test delete button triggers confirmation dialog",
        "Run unit tests: pnpm test:run - all tests must pass",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 5,
      "passes": false,
      "notes": ""
    },
    {
      "id": "UC-005",
      "title": "Implement enhanced confirmation dialog",
      "description": "As a user, I want to see what will be deleted before confirming, so I don't accidentally lose important data.",
      "acceptanceCriteria": [
        "Dialog title: \"Delete Group Stage\" (translated)",
        "Dialog description shows impact: \"This will delete X groups, unassign Y teams, and remove Z scheduled matches. Teams will remain in the tournament.\"",
        "Only show matches count if > 0",
        "Uses SimpleConfirmDialog with intent='danger' and destructive prop",
        "Confirm button: \"Delete Group Stage\" (translated)",
        "Cancel button focused by default (destructive action pattern)",
        "All new UI strings extracted to translation files",
        "Layout verified for responsiveness and RTL mirroring",
        "Typecheck passes",
        "Lint passes",
        "Create unit tests in app/features/competition/components/__tests__/CompetitionGroupStageDetails.test.tsx for confirmation dialog",
        "Test dialog shows correct impact counts (groups, teams, matches)",
        "Test dialog shows matches count only when > 0",
        "Test confirm action triggers delete",
        "Test cancel action closes dialog without deleting",
        "Run unit tests: pnpm test:run - all tests must pass",
        "Verify in browser using dev-browser skill"
      ],
      "priority": 6,
      "passes": false,
      "notes": ""
    },
    {
      "id": "UC-006",
      "title": "Handle blocked deletion state",
      "description": "As a user, I want clear feedback when deletion is blocked due to existing match results.",
      "acceptanceCriteria": [
        "If canDeleteGroupStage returns canDelete: false, show toast error with reason",
        "Error message: \"Cannot delete: This group stage has matches with recorded results\" (translated)",
        "Delete button remains visible but action is rejected server-side",
        "All new UI strings extracted to translation files",
        "Typecheck passes",
        "Lint passes",
        "Create unit tests in test/routes/admin/competition/competition.groups.$groupStageId.test.ts for blocked deletion",
        "Test error toast shown when deletion blocked due to PLAYED matches",
        "Test correct error message displayed",
        "Run unit tests: pnpm test:run - all tests must pass"
      ],
      "priority": 7,
      "passes": false,
      "notes": ""
    }
  ]
}
